In [1]:
#Q1 program to create and display a one-dimensional array-like object containing an array of data using Pandas module

#series--->One-dimensional ndarray with axis labels (including time series)
import pandas as pd
df = pd.Series([2, 4, 6, 8, 10])
print(df)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [2]:
#Q2 program to convert a Panda module Series to Python list and itâ€™s type.

import pandas as pd 
df=pd.Series([24,6,8,7])
print("Pandas series an it's type:", type(df))
print("")

#Convert Pandas series modeule to Python list
print("Convert Pandas Series to Python list:", df.tolist())

Pandas series an it's type: <class 'pandas.core.series.Series'>

Convert Pandas Series to Python list: [24, 6, 8, 7]

In [9]:
#Q3 program to add, subtract, multiple and divide two Pandas Series.

d1=pd.Series([2,4,6,8,10])
d2=pd.Series([1,3,5,7,9])

#Addition
add=d1+d2
print("Addition of the Series:",add)
print("")

#Subtraction
sub=d1-d2
print("Subtraction of the Series:",sub)
print("")

#Multiplication
mul=d1*d2
print("Multiplication of the Series:",mul)
print("")

#Division
div=d1/d2
print("Division of the Series:",div)

Addition of the Series: 0     3
1     7
2    11
3    15
4    19
dtype: int64

Subtraction of the Series: 0    1
1    1
2    1
3    1
4    1
dtype: int64

Multiplication of the Series: 0     2
1    12
2    30
3    56
4    90
dtype: int64

Division of the Series: 0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [12]:
#Q4  program to compare the elements of the two Pandas Series

d1=pd.Series([2, 4, 6, 8, 10])
d2=pd.Series([1, 3, 5, 7, 10])

#Comparison
equal_or_not=d1==d2
print("Comparison of 2 series:",equal_or_not)

Comparison of 2 series: 0    False
1    False
2    False
3    False
4     True
dtype: bool

In [14]:
#Q5 program to convert a dictionary to a Pandas series.

d1 = {'a': 100, 'b': 200, 'c':300, 'd':400, 'e':800}
print("Dictionary:",d1)
print("")

d=pd.Series(d1)
print("Pandas:",d)

Dictionary: {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}

Pandas: a    100
b    200
c    300
d    400
e    800
dtype: int64

In [23]:
#Q6 program to convert a NumPy array to a Pandas series

import numpy as np
import pandas as pd

d1=np.array([5,2,7,9])
print("Numpy array:",d1)
print("")

d2=pd.Series(d1)
print("Pandas dataframe:",d2)

Numpy array: [5 2 7 9]

Pandas dataframe: 0    5
1    2
2    7
3    9
dtype: int32

In [3]:
#Q7 program to convert the first column of a DataFrame as a Series

import pandas as pd
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("")
s1 = df.ix[:,0]
print("\n1st column as a Series:")
print(s1)
print(type(s1))

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

AttributeError: 'DataFrame' object has no attribute 'ix'

# PANDAS WITH DATAFRAME

In [1]:
import pandas as pd
import numpy as np

In [2]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [3]:
#1  display a summary of the basic information about a specified DataFrame and its data
print(df.info)

<bound method DataFrame.info of         name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes>

In [4]:
#2 program to get the first 3 rows of a given DataFrame

print(df[:3])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [5]:
#3 to select the 'name' and 'score' columns from the following DataFrame

print(df[['name','score']])

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [6]:
#4  select the specified columns and rows from a given data frame

print(df.iloc[[1,3,5,7],[1,3]])

#iloc-->.iloc[] is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
h    NaN      no

In [7]:
#5  to select the rows where the number of attempts in the examination is greater than 2

print(df[df['attempts']>2])

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [8]:
#6  to count the number of rows and columns of a DataFrame

rows=len(df.axes[0])
col=len(df.axes[1])
print("Total number of rows:"+str(rows))
print("Total number of columns:"+str(col))

#axes-->Return a list representing the axes of the DataFrame.

Total number of rows:10
Total number of columns:4

In [9]:
#7 program to select the rows where the score is missing, i.e. is NaN

print(df[df['score'].isnull()])

#isnull--->Detect missing values.

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [10]:
#8  to select the rows the score is between 15 and 20 (inclusive)

print(df[df['score'].between(15,20)])

#between--->return boolean Series equivalent to left <= series <= right.

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [11]:
#9 to select the rows where number of attempts in the examination is less than 2 and score greater than 15. 

print(df[(df['attempts']<2) & (df['score']>15)])

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [12]:
#10 program to change the score in row 'd' to 11.5

df1=pd. (df.loc['d','score']==11.5)
print(df1)

#print("\nOriginal data frame:")
#print(df)
#print("\nChange the score in row 'd' to 11.5:")
#df.loc['d', 'score'] = 11.5
#print(df)

SyntaxError: invalid syntax (<ipython-input-12-75232ad4f560>, line 3)

In [13]:
#11 program to calculate the sum of the examination attempts by the students

print(df['attempts'].sum())

19

In [14]:
#12 to calculate the mean score for each different student in DataFrame

df.mean()

score       13.5625
attempts     1.9000
dtype: float64

In [15]:
#13 program to append a new row 'k' to data frame with given values for each column.Now delete the new row and return the 
#original DataFrame

print("Original dataframe:")
print(df)
print('\n')

print("Appened a new dataframe:")
df.loc['k']=['Ranbir',19.8,1,'yes',]
print("Printing new column:")
print(df)
print('\n')

print("Deleting the appended row:")
df=df.drop('k')
print(df)

Original dataframe:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes


Appened a new dataframe:
Printing new column:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Ranbir   19.8         1     yes


Deleting the appended row:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [16]:
#14 program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

df.sort_values(by=['name','score'],ascending=[False,True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [17]:
df.sort_values(by=['score','name'],ascending=[True,False])

        name  score  attempts qualify
i      Kevin    8.0         2      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes
g    Matthew   14.5         1     yes
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
f    Michael   20.0         3     yes
h      Laura    NaN         1      no
d      James    NaN         3      no

In [18]:
#15 program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

df.replace(to_replace=['yes','no'],value=['True','False'])

        name  score  attempts qualify
a  Anastasia   12.5         1    True
b       Dima    9.0         3   False
c  Katherine   16.5         2    True
d      James    NaN         3   False
e      Emily    9.0         2   False
f    Michael   20.0         3    True
g    Matthew   14.5         1    True
h      Laura    NaN         1   False
i      Kevin    8.0         2   False
j      Jonas   19.0         1    True

In [19]:
#16 program to change the name 'James' to 'Suresh' in name column of the DataFrame.

df.replace(to_replace=['James'],value=['Suresh'])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [20]:
#17 program to delete the 'attempts' column from the DataFrame.

df=df.drop(axis=0,columns='attempts')
print(df)

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

In [21]:
#18 program to insert a new column in existing DataFrame. 

gender=['female','female','female','male','female','male','male','female','male','male']
df['gender']=gender
df

        name  score qualify  gender
a  Anastasia   12.5     yes  female
b       Dima    9.0      no  female
c  Katherine   16.5     yes  female
d      James    NaN      no    male
e      Emily    9.0      no  female
f    Michael   20.0     yes    male
g    Matthew   14.5     yes    male
h      Laura    NaN      no  female
i      Kevin    8.0      no    male
j      Jonas   19.0     yes    male

In [22]:
#19 program to iterate over rows in a DataFrame.

for i,r in df.iterrows():
    print(r['name'],r['score'])

Anastasia 12.5
Dima 9.0
Katherine 16.5
James nan
Emily 9.0
Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Jonas 19.0

In [23]:
#20 program to get list from DataFrame column headers

print(list(df.columns.values))

['name', 'score', 'qualify', 'gender']

In [24]:
#21 program to rename columns of a given DataFrame

import pandas as pd
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)

df.columns = ['Column1', 'Column2', 'Column3']
df = df.rename(columns={'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'})
print("\n")
print("New DataFrame after renaming columns:")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9


New DataFrame after renaming columns:
   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

In [25]:
#22 program to select rows from a given DataFrame based on values in some columns

import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)
print("\n")

print('Rows for column1 value == 4')
print(df.loc[df['col1'] == 4])

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1


Rows for column1 value == 4
   col1  col2  col3
1     4     5     8
3     4     7     0

In [26]:
#23 program to change the order of a DataFrame columns.

df=df[['col3','col1','col2']]
print(df)

   col3  col1  col2
0     7     1     4
1     8     4     5
2     9     3     6
3     0     4     7
4     1     5     8

In [27]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [28]:
#24 program to add one row in an existing DataFrame

df1={'col1':15,'col2':14,'col3':16}
df=df.append(df1,ignore_index=True)
print(df)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    15    14    16

In [29]:
#25 program to write a DataFrame to CSV file using tab separator.

df.to_csv('new_file.csv',sep='\t',index=False)
new_df=pd.read_csv('new_file.csv')
print(new_df)

  col1\tcol2\tcol3
0          1\t4\t7
1          4\t5\t8
2          3\t6\t9
3          4\t7\t0
4          5\t8\t1
5       15\t14\t16

In [30]:
#26 program to count city wise number of people from a given of data set (city, name of the person)

import pandas as pd
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
print(df1)

        name         city
0  Anastasia   California
1       Dima  Los Angeles
2  Katherine   California
3      James   California
4      Emily   California
5    Michael  Los Angeles
6    Matthew  Los Angeles
7      Laura      Georgia
8      Kevin      Georgia
9      Jonas  Los Angeles

In [31]:
g1 = df1.groupby(["city"]).size().reset_index(name='Number of people')
print(g1)

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [32]:
#27 program to delete DataFrame row(s) based on given column value

d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)

#df=df[df.co12!=5]
#print(df1)
print("\n")
df = df[df.col2 != 5]
print("New DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1


New DataFrame
   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

In [33]:
#27 program to widen output display to see more columns

d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
print("Original DataFrame")
print(df)

print("\n")

pd.set_option("display.max_rows",500)
pd.set_option("display.max_columns",500)
pd.set_option("display.width",1000)
df

#set_option() function in Python. Pandas have an options system that lets you customize some aspects of its behavior, 
#display-related options being those the user is most likely to adjust

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [34]:
#28  program to select a row of series/dataframe by given integer index

#iloc->Purely integer-location based indexing for selection by position.

result=df.iloc[[3]]
result

   col1  col2  col3
3     4     7     0

In [35]:
#29 program to replace all the NaN values with Zero's in a column of a dataframe.

import numpy as np
import pandas as pd
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame")
df

Original DataFrame

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [36]:
df.fillna(value=0)

#fillna->Fill NA/NaN values using the specified method.

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [37]:
#30 program to convert index in a column of the given dataframe


#reset_index->Reset the index, or a level of it
print("\nAfter converting index in a column:")
df.reset_index(level=0, inplace=True)
print(df)

#to_string->used to render(provide) a DataFrame to a console-friendly tabular output.
print("\nHiding index:")
print( df.to_string(index=False))

After converting index in a column:
   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

Hiding index:
 index       name  score  attempts qualify
     0  Anastasia   12.5         1     yes
     1       Dima    9.0         3      no
     2  Katherine   16.5         2     yes
     3      James    NaN         3      no
     4      Emily    9.0         2      no
     5    Michael   20.0         3     yes
     6    Matthew   14.5         1     yes
     7      Laura    NaN         1      no
     8      Kevin    8.0         2      no
     9      Jonas   19.0         1     yes

In [47]:
#31 program to set a given value for particular cell in  DataFrame using index value

print("Original Value:")
print(df)

print("\nSet a given value for particular cell in the DataFrame")
df.set_value(8, 'score', 10.2)
print(df)

Original Value:
   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

Set a given value for particular cell in the DataFrame

AttributeError: 'DataFrame' object has no attribute 'set_value'

In [51]:
#32 program to count the NaN values in one or more columns in DataFrame

print("the NaN values in one or more columns in DataFrame:",df.isnull().values.sum())

the NaN values in one or more columns in DataFrame: 2

In [58]:
#33 program to drop a list of rows from a specified DataFrame.

import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(d)
print("Original DataFrame")
print(df)

print("")
print("New DataFrame after removing 2nd & 4th rows:")
df=df.drop(df.index[[3,4]])
df

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

New DataFrame after removing 2nd & 4th rows:

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9

In [64]:
#34  program to reset index in a given DataFrame

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("\nOriginal DataFrame")
print(df)

print("\nAfter removing first and second rows")
df=df.drop([0,1])
print(df)

print("\nReset the Index")
df=df.reset_index()
print(df)

Original DataFrame
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

After removing first and second rows
        name  score  attempts qualify
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Reset the Index
   index       name  score  attempts qualify
0      2  Katherine   16.5         2     yes
1      3      James    NaN         3      no
2      4      Emily    9.0         2      no
3      5    Michael   20.0         3     yes
4      6    Matthew   14.5         1     yes
5      7      Laura    NaN         1      no
6      8      Kevin    8.0         2      no
7      9      Jonas   19.0         1     yes

In [76]:
#35 program to divide a DataFrame in a given ratio

#DataFrame.sample(n=None, frac=None, replace=False, weights=None, random_state=None, axis=None, ignore_index=False)
import pandas as pd
import numpy as np
df=pd.DataFrame(np.random.randn(10,2)) #10=number of rows,#2=number of columns
print("Original data:")
print(df)
print("")

part_80=df.sample(frac=0.8,random_state=10)#random11-state->generate number
part_20=df.drop(part_80.index)
print("80% of the dataframe:")
print(part_80)
print("")

print("20% of the dataframe dropped:")
print(part_20)

Original data:
          0         1
0  0.191959  1.380217
1  0.915415 -0.314813
2 -0.317901 -1.270560
3 -1.489115 -1.119786
4 -0.578772  0.177105
5  0.635001 -1.317086
6  0.827544 -1.011290
7  1.537752  0.593862
8  1.510805 -0.195366
9 -0.204835  1.160621

80% of the dataframe:
          0         1
8  1.510805 -0.195366
2 -0.317901 -1.270560
5  0.635001 -1.317086
6  0.827544 -1.011290
3 -1.489115 -1.119786
1  0.915415 -0.314813
0  0.191959  1.380217
7  1.537752  0.593862

20% of the dataframe dropped:
          0         1
4 -0.578772  0.177105
9 -0.204835  1.160621

In [82]:
#36 program to combining two series into a DataFrame

import pandas as pd
s1=pd.Series(['100','200',' python','300.12','400'])
s2=pd.Series(['10','20','php','30.12','40'])
print("Data Series 1")
print(s1)
print("")

print("Data Series 2")
print(s2)
print("")

df=pd.concat([s1,s2],axis=1)
print("New dataframe combining Series 1 and Series 2:")
print(df)

Data Series 1
0        100
1        200
2     python
3     300.12
4        400
dtype: object

Data Series 2
0       10
1       20
2      php
3    30.12
4       40
dtype: object

New dataframe combining Series 1 and Series 2:
         0      1
0      100     10
1      200     20
2   python    php
3   300.12  30.12
4      400     40

In [85]:
#37 program to shuffle a given DataFrame rows

import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
print("Original DataFrame:")
print(df)
print("")

df=df.sample(frac=1)
print("Shuffled dataframe:")
print(df)

Original DataFrame:
        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Shuffled dataframe:
        name  score  attempts qualify
4      Emily    9.0         2      no
7      Laura    NaN         1      no
6    Matthew   14.5         1     yes
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
5    Michael   20.0         3     yes

In [94]:
#38  convert DataFrame column type from string to datetime

import pandas as pd
s1=pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
print("String datetime:\n")
print(s1)
print("")

date=pd.to_datetime(pd.Series(s1))
df=pd.DataFrame(date)
print("Conversion of string to datetime:")
print(df)

String datetime:

0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object

Conversion of string to datetime:
           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

In [2]:
#39 program to rename a specific column name in a given DataFrame.

import pandas as pd
d={'col1':[1,2,3,],'col2':[4,5,6],'col3':[7,8,9]}
df=pd.DataFrame(data=d)
print("Original data:")
print(df)
print("")

df=df.rename(columns={'col2':'column2'})
print("Renamed column:")
print(df)

Original data:
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

Renamed column:
   col1  column2  col3
0     1        4     7
1     2        5     8
2     3        6     9

In [5]:
#40 program to get a list of a specified column of a DataFrame

#tolist->Return a list of the values
import pandas as pd
d={'col1':[1,2,3,],'col2':[4,5,6],'col3':[7,8,9]}
df=pd.DataFrame(data=d)
print("Original data:")
print(df)
print("")

col_extract=df['col2'].tolist()
print("->A list of a specified column of a DataFrame:",col_extract)

Original data:
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

->A list of a specified column of a DataFrame: [4, 5, 6]